; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v13)
             (pred_10 ?v12 ?v6)
             (pred_6 ?v3 ?v6)
             (pred_7 ?v5 ?v3 )
	     (pred_11 ?v3)
             (pred_5 ?v9)
             (pred_2 ?v12)
             (pred_8 ?v6)
             (pred_3 ?v3)
             (pred_9 ?v12)
             (pred_4 ?v3)
             (pred_1 ))



(:action op_5
:parameters (?v4 ?v2 ?v1 ?v8)
:precondition (and (pred_5 ?v4) (pred_5 ?v2) (pred_2 ?v1) (pred_8 ?v8)
          (pred_12 ?v4 ?v2) (pred_10 ?v1 ?v8)
                   (pred_6 ?v2 ?v8) (pred_11 ?v4) 
                   (pred_3 ?v2) (pred_9 ?v1))
:effect (and  (pred_4 ?v2) (not (pred_3 ?v2))))


(:action op_3
:parameters (?v4 ?v10)
:precondition (and (pred_5 ?v4) (pred_5 ?v10)
               (pred_11 ?v4) (pred_12 ?v4 ?v10) (pred_4 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v4))))

(:action op_2
:parameters (?v4 ?v1)
:precondition (and (pred_5 ?v4) (pred_2 ?v1) 
                  (pred_11 ?v4) (pred_7 ?v1 ?v4) (pred_1 ))
:effect (and (pred_9 ?v1)
   (not (pred_7 ?v1 ?v4)) (not (pred_1 ))))


(:action op_1
:parameters (?v4 ?v11 ?v7)
:precondition (and (pred_5 ?v4) (pred_2 ?v11) (pred_2 ?v7)
                  (pred_11 ?v4) (pred_9 ?v7) (pred_7 ?v11 ?v4))
:effect (and (pred_9 ?v11) (pred_7 ?v7 ?v4)
        (not (pred_9 ?v7)) (not (pred_7 ?v11 ?v4))))

(:action op_4
:parameters (?v4 ?v1)
:precondition (and (pred_5 ?v4) (pred_2 ?v1) 
                  (pred_11 ?v4) (pred_9 ?v1))
:effect (and (pred_1 ) (pred_7 ?v1 ?v4) (not (pred_9 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_13 obj_16 obj_05 obj_01 obj_27 obj_15 obj_02 obj_22 obj_19 obj_28 obj_06 obj_23 obj_03 obj_10 obj_12 obj_14 obj_21 obj_11 obj_30 obj_18 obj_25 obj_04 obj_07 obj_32 obj_17
    obj_31 obj_24 obj_20
    obj_29 obj_08 obj_26 obj_09
    )

    (:init
       (pred_1)

       (pred_5 obj_13)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_01)
       (pred_5 obj_27)
       (pred_5 obj_15)
       (pred_5 obj_02)
       (pred_5 obj_22)
       (pred_5 obj_19)
       (pred_5 obj_28)
       (pred_5 obj_06)
       (pred_5 obj_23)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_5 obj_14)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_30)
       (pred_5 obj_18)
       (pred_5 obj_25)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_32)
       (pred_5 obj_17)
       (pred_8 obj_31)
       (pred_8 obj_24)
       (pred_8 obj_20)
       (pred_2 obj_29)
       (pred_2 obj_08)
       (pred_2 obj_26)
       (pred_2 obj_09)

       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_16)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_16 obj_13)
       (pred_12 obj_05 obj_22)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_27)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_27 obj_28)
       (pred_12 obj_27 obj_01)
       (pred_12 obj_15 obj_06)
       (pred_12 obj_15 obj_02)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_02 obj_23)
       (pred_12 obj_02 obj_22)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_22 obj_03)
       (pred_12 obj_22 obj_19)
       (pred_12 obj_22 obj_05)
       (pred_12 obj_22 obj_02)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_28)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_22)
       (pred_12 obj_28 obj_12)
       (pred_12 obj_28 obj_27)
       (pred_12 obj_28 obj_19)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_06 obj_23)
       (pred_12 obj_06 obj_15)
       (pred_12 obj_23 obj_21)
       (pred_12 obj_23 obj_03)
       (pred_12 obj_23 obj_02)
       (pred_12 obj_23 obj_06)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_03 obj_22)
       (pred_12 obj_03 obj_23)
       (pred_12 obj_10 obj_30)
       (pred_12 obj_10 obj_12)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_12 obj_18)
       (pred_12 obj_12 obj_28)
       (pred_12 obj_12 obj_10)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_21)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_21 obj_23)
       (pred_12 obj_21 obj_14)
       (pred_12 obj_11 obj_07)
       (pred_12 obj_11 obj_30)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_30 obj_32)
       (pred_12 obj_30 obj_18)
       (pred_12 obj_30 obj_10)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_12)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_25 obj_04)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_04 obj_25)
       (pred_12 obj_07 obj_32)
       (pred_12 obj_07 obj_11)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_32 obj_17)
       (pred_12 obj_32 obj_30)
       (pred_12 obj_32 obj_07)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_32)
       (pred_3 obj_07)
       (pred_3 obj_22)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_6  obj_07 obj_31)
       (pred_6  obj_22 obj_24)
       (pred_6  obj_10 obj_20)
       (pred_6  obj_03 obj_24)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_27)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_28)
       (pred_4 obj_06)
       (pred_4 obj_23)
       (pred_4 obj_12)
       (pred_4 obj_14)
       (pred_4 obj_21)
       (pred_4 obj_11)
       (pred_4 obj_30)
       (pred_4 obj_18)
       (pred_4 obj_25)
       (pred_4 obj_04)
       (pred_4 obj_32)
       (pred_4 obj_17)

       (pred_10  obj_29 obj_31)
       (pred_10  obj_08 obj_24)
       (pred_10  obj_26 obj_20)
       (pred_10  obj_09 obj_31)
       (pred_7 obj_29 obj_11)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_26 obj_14)
       (pred_7 obj_09 obj_28)
       (pred_11 obj_16)
    )

    (:goal (and
       (pred_7 obj_29 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_21)))
)
)

; plan
1. (op_3 obj_16 obj_05)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_05)
   goals met: 0 of 1
2. (op_3 obj_05 obj_01)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_27)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_27)
   goals met: 0 of 1
4. (op_3 obj_27 obj_28)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_28)
   goals met: 0 of 1
5. (op_2 obj_28 obj_09)
   deleted: (pred_7 obj_09 obj_28) (pred_1)
   added: (pred_9 obj_09)
   goals met: 0 of 1
6. (op_3 obj_28 obj_12)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_12)
   goals met: 0 of 1
7. (op_3 obj_12 obj_18)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_18)
   goals met: 0 of 1
8. (op_3 obj_18 obj_30)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_30)
   goals met: 0 of 1
9. (op_3 obj_30 obj_11)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_11)
   goals met: 0 of 1
10. (op_1 obj_11 obj_29 obj_09)
   deleted: (pred_9 obj_09) (pred_7 obj_29 obj_11)
   added: (pred_9 obj_29) (pred_7 obj_09 obj_11)
   goals met: 0 of 1
11. (op_5 obj_11 obj_07 obj_29 obj_31)
   deleted: (pred_3 obj_07)
   added: (pred_4 obj_07)
   goals met: 0 of 1
12. (op_3 obj_11 obj_07)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_07)
   goals met: 0 of 1
13. (op_4 obj_07 obj_29)
   deleted: (pred_9 obj_29)
   added: (pred_1) (pred_7 obj_29 obj_07)
   goals met: 1 of 1
